In [155]:
import pandas as pd

In [156]:
tags = pd.read_csv('/Users/max/Downloads/àå¨¢/tags.csv')
len(tags)

3683

In [157]:
ratings = pd.read_csv('/Users/max/Downloads/àå¨¢/ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [159]:
movies = pd.read_csv('/Users/max/Downloads/àå¨¢/movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [160]:
links = pd.read_csv('/Users/max/Downloads/àå¨¢/links.csv')
links.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [161]:
joined_ratings = ratings.join(movies.set_index('movieId'), on='movieId')

In [ ]:
#Рейтинг комедий

In [162]:
comedy = joined_ratings[joined_ratings['genres']=='Comedy']
comedy_rating = comedy.groupby('title').agg({'rating':[lambda x: (sum(x>=4)-sum(x<4))]})
comedy_rating.columns = ['TOP']
comedy_rating.sort_values('TOP', ascending=False).head(5).reset_index()

                                 title   TOP
0  Monty Python's Life of Brian (1979)  33.0
1                        Clerks (1994)  32.0
2            This Is Spinal Tap (1984)  28.0
3               Raising Arizona (1987)  24.0
4                     Airplane! (1980)  21.0

In [ ]:
# Рейтинг фильмов в жанре Action

In [163]:
action = joined_ratings[joined_ratings['genres'].str.contains('Action', regex=False)]
action.groupby('title')[['rating']].sum().sort_values('rating', ascending=False).head()

                                           rating
title
Matrix, The (1999)                         1165.5
Star Wars: Episode IV - A New Hope (1977)  1062.0
Braveheart (1995)                           955.5
Fight Club (1999)                           931.5
Jurassic Park (1993)                        892.5

In [164]:
action_rating_sum = action.groupby('title')[['rating']].sum()

In [165]:
movies_with_tags = movies.join(tags.set_index('movieId'), on='movieId')

In [166]:
action_tags = movies_with_tags[movies_with_tags['genres'].str.contains('Action', regex=False)].groupby('title')[['tag']].count()+1

In [167]:
final_df = action_rating_sum.join(action_tags)
final_df.head()

                                             rating  tag
title
'71 (2014)                                      4.0    1
'Hellboy': The Seeds of Creation (2004)         4.0    1
10th Victim, The (La decima vittima) (1965)     4.0    1
12 Rounds (2009)                                9.0    1
13 Assassins (Jûsan-nin no shikaku) (2010)     16.0    1

In [168]:
final_df['total']= final_df['rating'] * final_df['tag']

In [169]:
final_df.sort_values('total', ascending=False).head(5)

                                                    rating  tag    total
title
Fight Club (1999)                                    931.5   55  51232.5
Star Wars: Episode IV - A New Hope (1977)           1062.0   27  28674.0
Léon: The Professional (a.k.a. The Professional...   534.5   36  19242.0
Inception (2010)                                     581.5   27  15700.5
Braveheart (1995)                                    955.5   11  10510.5